emacs.d/emacs.org
#+TITLE: Emacs Literate Configuration
#+AUTHOR: Niels Eigenraam
#+PROPERTY: header-args :tangle yes

* Configuration
:PROPERTIES:
:VISIBILITY: children
:END:

** Table of Contents :TOC_3_gh:
- [[#configuration][Configuration]]
  - [[#about-this-file][About this file]]
  - [[#org-file-tweaks][Org File Tweaks]]
    - [[#automatically-tangle][Automatically Tangle]]
    - [[#visibility-settings][Visibility Settings]]
    - [[#table-of-contents][Table of Contents]]
  - [[#personal-information][Personal Information]]
  - [[#emacs-initialization][Emacs Initialization]]
    - [[#settings][Settings]]
    - [[#package-management][Package Management]]
  - [[#packages][Packages]]
    - [[#aggressive-indent][Aggressive-indent]]
    - [[#company][Company]]
    - [[#counsel][Counsel]]
    - [[#embrace][Embrace]]
    - [[#evil][Evil]]
    - [[#eyebrowse][Eyebrowse]]
    - [[#flycheck][Flycheck]]
    - [[#general][General]]
    - [[#hydra][Hydra]]
    - [[#ivy][Ivy]]
    - [[#key-chord][Key-chord]]
    - [[#magit][Magit]]
    - [[#markdown-mode][Markdown-mode]]
    - [[#olivetti][Olivetti]]
    - [[#org][Org]]
    - [[#paredit][Paredit]]
    - [[#projectile][Projectile]]
    - [[#rainbow-delimiters][Rainbow-delimiters]]
    - [[#swiper][Swiper]]
    - [[#smart-mode-line][Smart mode-line]]
    - [[#themes][Themes]]
    - [[#toc-org][Toc-org]]
    - [[#rainbow-mode][Rainbow-mode]]
    - [[#which-key][Which-key]]
    - [[#yaml-mode][Yaml-mode]]
    - [[#yasnippet][Yasnippet]]
  - [[#utility-functions][utility functions]]
  - [[#editor][Editor]]
  - [[#editing][Editing]]
  - [[#hooks][Hooks]]
  - [[#post-initialization][Post Initialization]]

** About this file
I wanted something neat and tidy, so here we go.

** Org File Tweaks
There are a few tweaks included in this org file that make it a little easier to
work with.

*** Automatically Tangle
First there is a property defined on the file:

#+BEGIN_SRC :tangle no
header-args :tangle yes
#+END_SRC

This tells emacs to automatically tangle (include) all code blocks in this file when
generating the code for the config, unless the code block explicitly includes
=:tangle no= as the above code block does.

*** Visibility Settings
Next we have a property defined on the [[Configuration][Configuration]] heading that defines the visibility
that tells org to show it's direct children on startup. This way a clean outline of all
sub headings under Configuration is shown each time this file is opened in org-mode.

*** Table of Contents
Finally, there is a [[Table of Contents][Table of Contents]] heading that includes the tag: =:TOC_3_gh:=. This
tells an org-mode package =toc-org= to generate a table of contents under this heading
that has a max depth of 3 and is created using Github-style hrefs. This table of contents
is updated everytime the file is saved and makes for a functional table of contents that
works property directly on github.

** Personal Information
Let's set some variables with basic user information.

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Niels Eigenraam"
      user-mail-address "nielseigenraam@gmail.com")
#+END_SRC

** Emacs Initialization

*** Settings
We're going to increase the gc-cons-threshold to a very high number to decrease the load and compile time.
We'll lower this value significantly after initialization has completed. We don't want to keep this value
too high or it will result in long GC pauses during normal usage.

#+BEGIN_SRC emacs-lisp
(eval-and-compile
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6))
#+END_SRC

Disable certain byte compiler warnings to cut down on the noise. This is a personal choice and can be removed
if you would like to see any and all byte compiler warnings.

#+BEGIN_SRC emacs-lisp
(setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
#+END_SRC

*** Package Management

**** Package Settings
We're going to set the =load-path= ourselves and avoid calling =(package-initilize)= (for
performance reasons) so we need to set =package--init-file-ensured= to true to tell =package.el=
to not automatically call it on our behalf. Additionally we're setting
=package-enable-at-startup= to nil so that packages will not automatically be loaded for us since
=use-package= will be handling that.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    (setq load-prefer-newer t
          package-user-dir "~/.emacs.d/elpa"
          package--init-file-ensured t
          package-enable-at-startup nil)

    (unless (file-directory-p package-user-dir)
      (make-directory package-user-dir t)))
#+END_SRC

**** Use-Package Settings
Tell =use-package= to always defer loading packages unless explicitly told otherwise. This speeds up
initialization significantly as many packages are only loaded later when they are explicitly used.

#+BEGIN_SRC emacs-lisp
  (setq use-package-always-defer t
        use-package-verbose t)
#+END_SRC

**** Manually Set Load Path
We're going to set the load path ourselves so that we don't have to call =package-initialize= at
runtime and incur a large performance hit. This load-path will actually be faster than the one
created by =package-initialize= because it appends the elpa packages to the end of the load path.
Otherwise any time a builtin package was required it would have to search all of third party paths
first.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t))))
#+END_SRC

**** Initialize Package Management
Next we are going to require =package.el= and add our additional package archives, 'melpa' and 'org'.
Afterwards we need to initialize our packages and then ensure that =use-package= is installed, which
we promptly install if it's missing. Finally we load =use-package= and tell it to always install any
missing packages.

Note that this entire block is wrapped in =eval-when-compile=. The effect of this is to perform all
of the package initialization during compilation so that when byte compiled, all of this time consuming
code is skipped. This can be done because the result of byte compiling =use-package= statements results
in the macro being fully expanded at which point =use-package= isn't actually required any longer.

Since the code is automatically compiled during runtime, if the configuration hasn't already been
previously compiled manually then all of the package initialization will still take place at startup.

#+BEGIN_SRC emacs-lisp
  (eval-when-compile
    (require 'package)

    (unless (assoc-default "melpa" package-archives)
      (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t))
    (unless (assoc-default "org" package-archives)
      (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t))

    ;; (package-initialize)
    (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package))
    (require 'use-package)
    (setq use-package-always-ensure t))
#+END_SRC

**** No-littering
Keep your =.emacs.d/= clean! No-littering is included here because it kind of has to do
with package management. Also, it must be loaded early and the list of packages is supposed
to be alphabetical...

#+BEGIN_SRC emacs-lisp
(use-package no-littering
    :config
    (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
    (setq custom-file (no-littering-expand-etc-file-name "custom.el")))
#+END_SRC

** Packages
*** Aggressive-indent
What's in a name? I use this package for lisp modes only, I got scared using it in 
python-mode.

#+BEGIN_SRC emacs-lisp
(use-package aggressive-indent
  :config
  (add-hook 'emacs-lisp-mode-hook 'aggressive-indent-mode))
#+END_SRC

*** Company
Completion.

**** TODO org-mode backend

#+BEGIN_SRC emacs-lisp
(use-package company
  :demand t
  :config
  (setq company-idle-delay 0.3
        company-selection-wrap-around t)
  (add-hook 'after-init-hook 'global-company-mode))
#+END_SRC

*** Counsel
Counsel allows us to utilize ivy by replacing many built-in and common functions
with richer versions. Let's install it!

#+BEGIN_SRC emacs-lisp
(use-package counsel-projectile)
(use-package counsel
  :demand t)
#+END_SRC

*** Embrace
For use with evil-embrace

#+BEGIN_SRC emacs-lisp

#+END_SRC

*** Evil
Install, automatically load, and enable evil. It's like vim, but better! Especially
with [[https://github.com/emacs-evil/evil-collection][evil-collection]]!

#+BEGIN_SRC emacs-lisp
  (use-package evil
  :demand t
  :init
  (setq evil-want-integration nil)	; required by evil-collection
  (setq evil-want-Y-yank-to-eol t)	; Y == y$
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :demand t
  :config
  (setq evil-collection-outline-bind-tab-p nil)
  (evil-collection-init))

(use-package evil-surround
  :after evil
  :demand t
  :config
  (global-evil-surround-mode))

(use-package evil-embrace
  :after evil
  :demand t
  :config
  (add-hook 'org-mode-hook 'embrace-org-mode-hook)
  (evil-embrace-enable-evil-surround-integration))

(use-package evil-commentary
  :after evil
  :demand t
  :config
  (evil-commentary-mode))

(use-package evil-org
  :after org
  :demand t
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (evil-org-set-key-theme)))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+END_SRC
*** Eyebrowse
    
#+BEGIN_SRC emacs-lisp
(use-package eyebrowse
  :demand t
  :config
  (setq eyebrowse-new-workspace t
        eyebrowse-wrap-around t
        eyebrowse-switch-back-and-forth t)
  (eyebrowse-mode t))
  
#+END_SRC
*** Flycheck
Syntax checking, on the fly.
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :config
    (add-hook 'prog-mode-hook 'flycheck-mode))
#+END_SRC
*** General
Tyrannical keybinding 

#+BEGIN_SRC emacs-lisp
  (use-package general
    :demand t
    :config
    (general-create-definer evil-leader-def
      :states '(normal visual insert emacs)
      :prefix ","
      :non-normal-prefix "M-,")

    (evil-leader-def
      "t"  'hydra-toggle/body
      ":"  'counsel-find-file
      "e"  'eval-defun
      "i"  '(lambda () (interactive)
              (find-file "~/.emacs.d/emacs.org"))
      "o"  'olivetti-mode
      ","  'other-window
      "."  'mode-line-other-buffer
      "b"  'hydra-buffer/body
      "q"  'kill-buffer-and-window
      "w"  'save-buffer
      "x"  'counsel-M-x
      "p"  'counsel-yank-pop
      "m"  'counsel-bookmark
      "g" 'magit-status)

    (general-define-key
      :keymaps 'evil-insert-state-map
      (general-chord "jj") 'evil-normal-state
      "C-e" 'end-of-line
      "C-a" 'beginning-of-line
      "<M-tab>" 'company-complete-common-or-cycle)

    (general-evil-setup)

    (general-mmap
      "C-w n"   'evil-window-vnew
      "j"       'evil-next-visual-line
      "k"       'evil-previous-visual-line
      "-"       'dired-jump
      "_"       'counsel-recentf
      "C-e"     'evil-end-of-line
      ;; "C-w C-v" 'pfn-vsplit-new-buffer
      ;; "C-w C-h" 'pfn-hsplit-new-buffer
      "/"       'swiper)

    (general-nmap
      "C-c R" 'pfn-reload-init
      "C-c r" 'pfn-revert-buffer-no-confirm
      "C-c b" 'mode-line-other-buffer
      "C-c k" 'counsel-ag
      "C-c C-f" 'counsel-find-file
      "C-c a" 'hydra-org/body
      "M-/"   'hippie-expand
      "C-c l" 'org-store-link
      "C-c c" 'org-capture))
#+END_SRC

#+RESULTS:
: t

