emacs.d/emacs.el
(setq user-full-name "Niels Eigenraam"
      user-mail-address "nielseigenraam@gmail.com")

(eval-and-compile
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6))

(setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

(eval-and-compile
  (setq load-prefer-newer t
        package-user-dir "~/.emacs.d/elpa"
        package--init-file-ensured t
        package-enable-at-startup nil)

  (unless (file-directory-p package-user-dir)
    (make-directory package-user-dir t)))

(setq use-package-always-defer t
      use-package-verbose t)

(eval-and-compile
  (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t))))

(eval-when-compile
  (require 'package)

  (unless (assoc-default "melpa" package-archives)
    (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t))
  (unless (assoc-default "org" package-archives)
    (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t))

  ;; (package-initialize)
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t))

(use-package no-littering
    :config
    (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
    (setq custom-file (no-littering-expand-etc-file-name "custom.el")))

(use-package aggressive-indent
  :config
  (add-hook 'emacs-lisp-mode-hook 'aggressive-indent-mode))

(use-package company
  :demand t
  :config
  (setq company-idle-delay 0.3
        company-selection-wrap-around t)
  (add-hook 'after-init-hook 'global-company-mode))

(use-package counsel-projectile)
(use-package counsel
  :demand t)



(use-package evil
  :demand t
  :init
  (setq evil-want-integration nil)	; required by evil-collection
  (setq evil-want-Y-yank-to-eol t)	; Y == y$
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :config
  (setq evil-collection-outline-bind-tab-p nil)
  (evil-collection-init))

(use-package evil-surround
  :after evil
  :demand t
  :config
  (global-evil-surround-mode))

(use-package evil-embrace
  :after evil
  :config
  (add-hook 'org-mode-hook 'embrace-org-mode-hook)
  (evil-embrace-enable-evil-surround-integration))

(use-package evil-commentary
  :after evil
  :demand t
  :config
  (evil-commentary-mode))

(use-package evil-org
  :after org
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (evil-org-set-key-theme)))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package eyebrowse
  :demand
  :config
  (setq eyebrowse-new-workspace t
        eyebrowse-wrap-around t
        eyebrowse-switch-back-and-forth t)
  (eyebrowse-mode t))

(use-package flycheck
  :config
  (add-hook 'prog-mode-hook 'flycheck-mode))

(use-package general
  :demand t
  :config
  (general-create-definer evil-leader-def
    :states '(normal visual insert emacs)
    :prefix ","
    :non-normal-prefix "M-,")

  (evil-leader-def
    "t"  'hydra-toggle/body
    ":"  'counsel-find-file
    "e"  'eval-defun
    ;; "i"  'pfn-open-init-file
    "o"  'olivetti-mode
    ","  'other-window
    "."  'mode-line-other-buffer
    "b"  'hydra-buffer/body
    "q"  'kill-buffer-and-window
    "w"  'save-buffer
    "x"  'counsel-M-x
    "p"  'counsel-yank-pop
    "m"  'counsel-bookmark)

  (general-define-key
    :keymaps 'evil-insert-state-map
    (general-chord "jj") 'evil-normal-state
    "C-e" 'end-of-line
    "C-a" 'beginning-of-line
    "<M-tab>" 'company-complete-common-or-cycle)

  (general-evil-setup)

  (general-mmap
    "j"       'evil-next-visual-line
    "k"       'evil-previous-visual-line
    "-"       'dired-jump
    "_"       'counsel-recentf
    "C-e"     'evil-end-of-line
    ;; "C-w C-v" 'pfn-vsplit-new-buffer
    ;; "C-w C-h" 'pfn-hsplit-new-buffer
    "/"       'swiper)

  (general-nmap
    "C-c R" 'pfn-reload-init
    "C-c r" 'pfn-revert-buffer-no-confirm
    "C-c b" 'mode-line-other-buffer
    "C-c k" 'counsel-ag
    "C-c C-f" 'counsel-find-file
    "C-c a" 'hydra-org/body
    "M-/"   'hippie-expand
    "C-c l" 'org-store-link
    "C-c c" 'org-capture))
