emacs.d/emacs.org
*** Hydra

#+BEGIN_SRC emacs-lisp
(use-package hydra
  :demand t
  :config
  (defhydra hydra-buffer (:color blue :columns 3)
    " Buffers: "
    ("n" next-buffer "next" :color red)
    ("p" previous-buffer "prev" :color red)
    ("b" ivy-switch-buffer "ivy-switch")
    ("B" ibuffer "ibuffer")
    ("N" evil-buffer-new "new")
    ("s" save-buffer "save" :color red)
    ("d" kill-this-buffer "delete" :color red)
    ;; don't come back to previous buffer after delete
    ("D" (progn (kill-this-buffer) (next-buffer)) "Delete" :color red))

  (defhydra hydra-org (:color blue :columns 3)
    " AGENDA: "
    ("A" org-agenda "agenda menu" :color blue)
    ("a" org-agenda-list "agenda" :color blue)
    ("t" org-todo-list "global to do-list" :color blue)
    ("r" org-refile "refile" :color red)
    ("x" org-archive-subtree "archive" :color red))

  (defhydra hydra-toggle (:color blue :columns 3)
    " Toggle: "
    ("r" rainbow-mode "rainbow-mode" :color blue)
    ("f" flyspell-mode "flyspell-mode" :color red)
    ("p" paredit-mode "paredit" :color blue)
    ("a" aggressive-indent-mode "aggressive-indent-mode" :color red)))
 #+END_SRC   

*** Ivy
Generic completion frontend that's just awesome! Let's install and enable it.

#+BEGIN_SRC emacs-lisp
(use-package ivy
  :demand t
  :config
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-initial-inputs-alist nil))
#+END_SRC

*** Key-chord

#+BEGIN_SRC emacs-lisp
(use-package key-chord
  :demand t
  :config
  (key-chord-mode 1))
#+END_SRC

*** Magit
The magical git client. Let’s load magit only when one of the several entry 
point functions we invoke regularly outside of magit is called.

#+BEGIN_SRC emacs-lisp
(use-package magit
  :commands (magit-status magit-blame magit-log-buffer-file magit-log-all))
#+END_SRC

*** Markdown-mode

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :mode
  ("\\.md" . markdown-mode)
  ("\\.mdpp" . markdown-mode)
  :init
  (setq markdown-command "pandoc")
  (add-hook 'markdown-mode-hook 'turn-on-olivetti-mode)
  :config
  (font-lock-add-keywords 'markdown-mode
                          '(("@[[:alnum:]]+" . font-lock-keyword-face))))
#+END_SRC
*** Olivetti

#+BEGIN_SRC emacs-lisp
(use-package olivetti
  :config
  (setq-default olivetti-body-width 90))
#+END_SRC

*** Org
Let's include a newer version of org-mode than the one that is built in. We're going
to manually remove the org directories from the load path, to ensure the version we
want is prioritized instead.

#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure org-plus-contrib
  :pin org
  :defer t
  :commands (org-capture)
  :config
  (setq org-directory "~/org"
        org-default-notes-file "~/org/werk.org"
        org-agenda-files '("~/org/werk.org")
        org-archive-location "~/org/archief::datetree/"
        org-log-done nil
        org-log-into-drawer t
        org-cycle-separator-lines 2
        outline-blank-line t            ; newlines are not content
        org-level-color-stars-only t
        org-return-follows-link t
        org-tags-column -80
        org-reverse-note-order t))      ; enter new note as first item

;; Ensure ELPA org is prioritized above built-in org.
(require 'cl)
(setq load-path (remove-if (lambda (x) (string-match-p "org$" x)) load-path))

(defun pfn-org-level-sizes ()
  "Stop the org-level headers from increasing in height relative to the other text."
  (interactive)
  (dolist (face '(org-level-1
                  org-level-2
                  org-level-3
                  org-level-4
                  org-level-5))
    (set-face-attribute face nil :height 1.0)))

(defun pfn-org-level-colors ()
  "Taste the rainbow!"
  (interactive)
  (set-face-attribute 'org-level-1 nil :foreground "#87ffff")
  (set-face-attribute 'org-level-2 nil :foreground "#87d7ff")
  (set-face-attribute 'org-level-3 nil :foreground "#5fffaf")
  (set-face-attribute 'org-level-4 nil :foreground "#87ffff")
  (set-face-attribute 'org-level-5 nil :foreground "#87d7ff")
  (set-face-attribute 'org-level-6 nil :foreground "#5fffaf"))

(eval-after-load "org" '(progn (pfn-org-level-colors)
                               (pfn-org-level-sizes)))

(defun pfn-org-checkbox-todo ()
  "Switch header TODO state to DONE when all checkboxes are ticked, to TODO otherwise."
  (let ((todo-state (org-get-todo-state)) beg end)
    (unless (not todo-state)
      (save-excursion
    (org-back-to-heading t)
    (setq beg (point))
    (end-of-line)
    (setq end (point))
    (goto-char beg)
    (if (re-search-forward "\\[\\([0-9]*%\\)\\]\\|\\[\\([0-9]*\\)/\\([0-9]*\\)\\]"
                   end t)
        (if (match-end 1)
        (if (equal (match-string 1) "100%")
            (unless (string-equal todo-state "DONE")
              (org-todo 'done))
          (unless (string-equal todo-state "TODO")
            (org-todo 'todo)))
          (if (and (> (match-end 2) (match-beginning 2))
               (equal (match-string 2) (match-string 3)))
          (unless (string-equal todo-state "DONE")
            (org-todo 'done))
        (unless (string-equal todo-state "TODO")
          (org-todo 'todo)))))))))
(add-hook 'org-checkbox-statistics-hook 'pfn-org-checkbox-todo)

(setq org-todo-keyword-faces
      '(("TODO" . "#c991e1")
        ("AFSPRAAK" . "#aaffe4")
        ("BELLEN" . "#aaffe4")
        ("INTAKE" . "#aaffe4")
        ("CANCELED" . "#ff5458")
        ("TOREAD" . "#65b2ff")
        ("IDEE" . "#65b2ff")))

(setq org-refile-targets
      '((nil :maxlevel . 1)
        (org-agenda-files :maxlevel . 1)))

(setq org-capture-templates
      '(("w" "word" entry (file+headline "~/org/dict.org" "Words") "* %? :: ")
        ("W" "usage" entry (file+headline "~/org/dict.org" "Usage") "* %? :: ")
        ("t" "todo" entry (file+headline "~/org/todo.org" "To Do") "* TODO %?")
        ("l" "link" entry (file+headline "~/org/todo.org" "To Do") "* READ [[%?][]]")
        ("n" "note" entry (file+headline "~/org/todo.org" "Notes") "* %?")))
#+END_SRC
*** Paredit

#+BEGIN_SRC emacs-lisp
(use-package paredit
  :ensure t
  :config
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode))
#+END_SRC

*** Projectile
Projectile is a quick and easy project management package that "just works". We're
going to install it and make sure it's loaded immediately.

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :demand t)
#+END_SRC

*** Rainbow-delimiters
Taste them!

#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :demand t
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
#+END_SRC

*** Swiper
Swiper is an awesome searching utility with a quick preview. Let’s install it and load it when swiper or swiper-all is called.

#+BEGIN_SRC emacs-lisp
(use-package swiper
  :commands (swiper swiper-all))
#+END_SRC

*** Smart mode-line
Enable custom themes to avoid the popup every launch:

#+BEGIN_SRC emacs-lisp
(setq custom-safe-themes t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package smart-mode-line
  :ensure t
  :demand t
  :config
  (line-number-mode t)
  (column-number-mode t)

  (setq sml/theme 'respectful
        sml/shorten-directory t
        sml/name-width 40
        sml/mode-width 'right)
  (sml/setup))

(use-package minions
  :ensure t
  :demand t
  :config
  (minions-mode 1))
#+END_SRC

*** Themes
Can't have enough of these.

#+BEGIN_SRC emacs-lisp
(use-package challenger-deep-theme)
(use-package nord-theme)
(use-package solarized-theme)
#+END_SRC

*** Toc-org
This is the package that automatically generates an up to date table of contents for us.

#+BEGIN_SRC emacs-lisp
(use-package toc-org
  :after org
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+END_SRC

*** Rainbow-mode
highlight color names with their own names, it's awesome!

#+BEGIN_SRC emacs-lisp
(use-package rainbow-mode)
#+END_SRC

*** Which-key
For the lost.
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :demand t
  :config
  (which-key-mode))
#+END_SRC

*** Yaml-mode
So much better than biblatex.    

#+BEGIN_SRC emacs-lisp
(use-package yaml-mode
  :mode
  ("\\.yml" . yaml-mode)
  ("\\.yaml" . yaml-mode)
  :config
  (add-hook 'yaml-mode-hook 'display-line-numbers-mode)
  (add-hook 'yaml-mode-hook 'delete-trailing-whitespace))
#+END_SRC
*** Yasnippet

#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :config
  (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
  (with-eval-after-load 'warnings
    (add-to-list 'warning-suppress-types '(yasnippet backquote-change)))
  (yas-global-mode 1))
#+END_SRC
** utility functions
