emacs.d/emacs.el

(load-theme 'challenger-deep t)

(set-face-attribute 'default nil :font "Hack 10" )
(fringe-mode '(8 . 8))
(set-face-attribute 'fringe nil :background nil)

;;; native line numbers
(setq display-line-numbers-width 4
      display-line-numbers-width-start 3
      display-line-numbers-widen t)
(set-face-attribute 'line-number nil :background 'unspecified)

(setq-default
 confirm-kill-emacs 'yes-or-no-p             ; Confirm before exiting Emacs
 help-window-select t                        ; Focus new help windows when opened
 indent-tabs-mode nil                        ; Stop using tabs to indent
 tab-width 4                                 ; Set width for tabs
 fill-column 80                              ; Set width for automatic line breaks
 visual-bell nil                             ; plz no visual bell
 ring-bell-function 'ignore
 mouse-yank-at-point t                       ; Yank at point rather than pointer
 scroll-conservatively most-positive-fixnum  ; Always scroll by one line
 indicate-empty-lines nil                    ; no fuzz at the end of a file
 vc-follow-symlinks t)	               ; so you end up at the file itself 
                                             ;rather than editing the link
(show-paren-mode t)
(fset 'yes-or-no-p 'y-or-n-p)                ; Replace yes/no prompts with y/n

(scroll-bar-mode -1)                         ; Disable the scroll bar
(tool-bar-mode -1)                           ; Disable the tool bar
(tooltip-mode -1)                            ; Disable the tooltips
(menu-bar-mode -1)                           ; Disable the menu bar

(put 'dired-find-alternate-file 'disabled nil)

(put 'downcase-region 'disabled nil)              ; Enable downcase-region
(put 'upcase-region 'disabled nil)                ; Enable upcase-region
(put 'narrow-to-region 'disabled nil)             ; Enable narrowing

(setq
 ispell-silently-savep t
 ispell-dictionary "dutch"
 ispell-extra-args '("-a" "utf-8"))

(setq sentence-end-double-space nil)

(setq hippie-expand-try-functions-list
      '(try-complete-file-name-partially
	try-complete-file-name
	try-expand-dabbrev
	try-expand-dabbrev-all-buffers
	try-expand-dabbrev-from-kill))

(defun pfn-text-mode-hooks ()
  "Load 'text-mode' hooks."
  (turn-on-auto-fill)
  (rainbow-delimiters-mode 1)
  (abbrev-mode 1))
(add-hook 'text-mode-hook 'pfn-text-mode-hooks)

(defun pfn-setup-prog-mode ()
  "Load 'prog-mode' minor modes."
  (auto-fill-mode)
  (rainbow-delimiters-mode)
  (display-line-numbers-mode)
  (delete-trailing-whitespace)
  (flycheck-mode 1))
(add-hook 'prog-mode-hook 'pfn-setup-prog-mode)

(defun pfn-setup-lisp-mode ()
  "Setup lisp-modes such as racket and emacs-lisp."
  (interactive)
  (eldoc-mode 1)
  (paredit-mode)
  (aggressive-indent-mode))
(add-hook 'emacs-lisp-mode 'pfn-setup-lisp-mode)

(add-hook 'after-init-hook 'global-company-mode)
(add-hook 'focus-out-hook #'garbage-collect)

(setq gc-cons-threshold 16777216
      gc-cons-percentage 0.1)
